<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2023-01-01">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /home/dimas/anaconda3/lib/python3.9/site-packages (2.9.6)

In [2]:
import psycopg2 # Connect to PostgreSQL database
import pandas as pd # Dataset management

In [20]:
conn = psycopg2.connect(
    host="localhost",
    database="test_db",
    user="dimas",
    password="pSQL99%#"
)

cursor = conn.cursor()

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [10]:
sql = """
        SELECT DISTINCT launch_site FROM launch;
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

              0
0  CCAFS SLC-40
1    KSC LC-39A
2   CCAFS LC-40
3   VAFB SLC-4E


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [14]:
sql = """
        SELECT * FROM launch
        WHERE launch_site LIKE 'CCA%'
        LIMIT 5;
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

,0,1,2,3,4,5,6,7,8,9,10,11
0,2010-06-04,None,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0.0,LEO,SpaceX,Success,None,18:45:00,Failure (parachute)
1,2010-12-08,None,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0.0,LEO (ISS),NASA (COTS) NRO,Success,None,15:43:00,Failure (parachute)
2,2012-05-22,None,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525.0,LEO (ISS),NASA (COTS),Success,None,07:44:00,No attempt
3,2012-10-08,None,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500.0,LEO (ISS),NASA (CRS),Success,None,00:35:00,No attempt
4,2013-03-01,None,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677.0,LEO (ISS),NASA (CRS),Success,None,15:10:00,No attempt

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [21]:
sql = """
        SELECT SUM(payload_mass__kg_) FROM launch
        WHERE payload LIKE '%CRS%';
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

          0
0  111268.0

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [22]:
sql = """
    SELECT AVG(payload_mass__kg_) FROM launch
    WHERE booster_version LIKE '%F9 v1.1%';
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

             0
0  2534.666667

### Task 5

##### List the date when the first successful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [23]:
sql = """
    select MIN(date) from launch2
    where landing_outcome like '%Succes%' and landing_outcome like '%ground%';
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

            0
0  2015-12-22

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [24]:
sql = """
    select booster_version from launch2
    where landing_outcome like '%Succes%' and landing_outcome like '%drone%'
        and payload_mass__kg_ between 4000 and 6000;
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

                0
0     F9 FT B1022
1     F9 FT B1026
2  F9 FT  B1021.2
3  F9 FT  B1031.2

### Task 7




##### List the total number of successful and failure mission outcomes

In [25]:
sql = """
    select count(1) from launch2 l 
    where mission_outcome like '%Success%';
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

     0
0  100

In [26]:
sql = """
    select count(1) from launch2 l 
    where mission_outcome like '%Failure%';
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

   0
0  1

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [28]:
sql = """
    SELECT Booster_Version FROM launch2
    WHERE PAYLOAD_MASS__KG_ = (
    SELECT MAX(PAYLOAD_MASS__KG_)
    FROM launch2
);
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

                 0
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

### Task 9


##### List the failed landing_outcomes in drone ship, their booster versions, and launch site names for in year 2015

In [29]:
sql = """
    select landing_outcome, booster_version, launch_site, "date" from launch2
    where landing_outcome like '%Fail%' and landing_outcome like '%drone%'
    and extract(year from "date") = 2015;
"""
cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

                      0              1            2           3
0  Failure (drone ship)  F9 v1.1 B1012  CCAFS LC-40  2015-01-10
1  Failure (drone ship)  F9 v1.1 B1015  CCAFS LC-40  2015-04-14

### Task 10

##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order

In [30]:
sql = """
    select count(1) as count_o, landing_outcome from launch2
    where "date" between '2010-06-04' and '2017-03-20'
    group by landing_outcome
    order by count_o desc;
"""

cursor.execute(sql)
data = cursor.fetchall()
pd.DataFrame(data)

    0                       1
0  10              No attempt
1   5    Failure (drone ship)
2   5    Success (drone ship)
3   3    Success (ground pad)
4   3      Controlled (ocean)
5   2    Uncontrolled (ocean)
6   2     Failure (parachute)
7   1  Precluded (drone ship)

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-10-12 | 0.4 |Lakshmi Holla | Changed markdown|
| 2021-08-24 | 0.3 |Lakshmi Holla | Added library update|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>